  List<String> almsaa = [
    'أَعُوذُ بِاللهِ مِنْ الشَّيْطَانِ الرَّجِيمِ\n'
    '﴿اللَّهُ لا إِلهَ إِلّا هُوَ الحَيُّ القَيّومُ لا تَأخُذُهُ سِنَةٌ وَلا نَومٌ لَهُ ما فِي السَّماواتِ وَما فِي الأَرضِ مَن ذَا الَّذي يَشفَعُ عِندَهُ إِلّا بِإِذنِهِ يَعلَمُ ما بَينَ أَيديهِم وَما خَلفَهُم وَلا يُحيطونَ بِشَيءٍ مِن عِلمِهِ إِلّا بِما شاءَ وَسِعَ كُرسِيُّهُ السَّماواتِ وَالأَرضَ وَلا يَئودُهُ حِفظُهُما وَهُوَ العَلِيُّ العَظيمُ﴾'
    ' [البقرة:255]',
    'أَعُوذُ بِاللهِ مِنْ الشَّيْطَانِ الرَّجِيمِ\n'
    '﴿آمَنَ الرَّسُولُ بِمَا أُنْزِلَ إِلَيْهِ مِنْ رَبِّهِ وَالْمُؤْمِنُونَ ۚ كُلٌّ آمَنَ بِاللَّهِ وَمَلَائِكَتِهِ وَكُتُبِهِ وَرُسُلِهِ لَا نُفَرِّقُ بَيْنَ أَحَدٍ مِنْ رُسُلِهِ ۚ وَقَالُوا سَمِعْنَا وَأَطَعْنَا ۖ غُفْرَانَكَ رَبَّنَا وَإِلَيْكَ الْمَصِيرُ۝لَا يُكَلِّفُ اللَّهُ نَفْسًا إِلَّا وُسْعَهَا لَهَا مَا كَسَبَتْ وَعَلَيْهَا مَا اكْتَسَبَتْ رَبَّنَا لَا تُؤَاخِذْنَا إِنْ نَّسِينَآ أَوْ أَخْطَأْنَا رَبَّنَا وَلَا تَحْمِلْ عَلَيْنَا إِصْرًا كَمَا حَمَلْتَهُ عَلَى الَّذِينَ مِنْ قَبْلِنَا رَبَّنَا وَلَا تُحَمِّلْنَا مَا لَا طَاقَةَ لَنَا بِهِ وَاعْفُ عَنَّا وَاغْفِرْ لَنَا وَارْحَمْنَا أَنْتَ مَوْلَانَا فَانْصُرْنَا عَلَى الْقَوْمِ الْكَافِرِينَ﴾'
    ' [البقرة:285-286]',
    '{بِسْمِ اللهِ الرَّحْمنِ الرَّحِيم}\n'
    '﴿قُل هُوَ اللَّهُ أَحَدٌ۝اللَّهُ الصَّمَدُ۝لَم يَلِد وَلَم يولَد۝وَلَم يَكُن لَهُ كُفُوًا أَحَدٌ﴾'
    ' [الإخلاص: 1-4]',
    '{بِسْمِ اللهِ الرَّحْمنِ الرَّحِيم}\n'
    '﴿قُل أَعوذُ بِرَبِّ الفَلَقِ۝مِن شَرِّ ما خَلَقَ۝وَمِن شَرِّ غاسِقٍ إِذا وَقَبَ۝وَمِن شَرِّ النَّفّاثاتِ فِي العُقَدِ۝وَمِن شَرِّ حاسِدٍ إِذا حَسَدَ﴾'
    ' [الفلق: 1-5]',
    '{بِسْمِ اللهِ الرَّحْمنِ الرَّحِيم}\n'
    '﴿قُل أَعوذُ بِرَبِّ النّاسِ۝مَلِكِ النّاسِ۝إِلهِ النّاسِ۝مِن شَرِّ الوَسواسِ الخَنّاسِ۝الَّذي يُوَسوِسُ في صُدورِ النّاسِ۝مِنَ الجِنَّةِ وَالنّاسِ﴾'
    ' [الناس: 1-6]',
    'بِسـمِ اللهِ الذي لا يَضُـرُّ مَعَ اسمِـهِ شَيءٌ في الأرْضِ وَلا في السّمـاءِ وَهـوَ السّمـيعُ العَلـيم',
    'أَعـوذُ بِكَلِمـاتِ اللّهِ التّـامّـاتِ مِنْ شَـرِّ ما خَلَـق',
    'رَضيـتُ بِاللهِ رَبَّـاً وَبِالإسْلامِ ديـناً وَبِمُحَـمَّدٍ صلى الله عليه وسلم نَبِيّـاً',
    'اللّهـمَّ أَنْتَ رَبِّـي لا إلهَ إلاّ أَنْتَ ، خَلَقْتَنـي وَأَنا عَبْـدُك ، وَأَنا عَلـى عَهْـدِكَ وَوَعْـدِكَ ما اسْتَـطَعْـت ، أَعـوذُبِكَ مِنْ شَـرِّ ما صَنَـعْت ، أَبـوءُ لَـكَ بِنِعْـمَتِـكَ عَلَـيَّ وَأَبـوءُ بِذَنْـبي فَاغْفـِرْ لي فَإِنَّـهُ لا يَغْـفِرُ الذُّنـوبَ إِلاّ أَنْتَ',
    'أَمْسَيْـنا وَأَمْسـى المـلكُ لله وَالحَمدُ لله ، لا إلهَ إلاّ اللّهُ وَحدَهُ لا شَريكَ لهُ، لهُ المُـلكُ ولهُ الحَمْـد، وهُوَ على كلّ شَيءٍ قدير ، رَبِّ أسْـأَلُـكَ خَـيرَ ما في هـذهِ اللَّـيْلَةِ وَخَـيرَ ما بَعْـدَهـا ، وَأَعـوذُ بِكَ مِنْ شَـرِّ ما في هـذهِ اللَّـيْلةِ وَشَرِّ ما بَعْـدَهـا ، رَبِّ أَعـوذُبِكَ مِنَ الْكَسَـلِ وَسـوءِ الْكِـبَر ، رَبِّ أَعـوذُ بِكَ مِنْ عَـذابٍ في النّـارِ وَعَـذابٍ في القَـبْر',
    'اللّهُـمَّ إِنِّـي أسْـأَلُـكَ العَـفْوَ وَالعـافِـيةَ في الدُّنْـيا وَالآخِـرَة ، اللّهُـمَّ إِنِّـي أسْـأَلُـكَ العَـفْوَ وَالعـافِـيةَ في ديني وَدُنْـيايَ وَأهْـلي وَمالـي ، اللّهُـمَّ اسْتُـرْ عـوْراتي وَآمِـنْ رَوْعاتـي ، اللّهُـمَّ احْفَظْـني مِن بَـينِ يَدَيَّ وَمِن خَلْفـي وَعَن يَمـيني وَعَن شِمـالي ، وَمِن فَوْقـي ، وَأَعـوذُ بِعَظَمَـتِكَ أَن أُغْـتالَ مِن تَحْتـي',
    'اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ الْهَمِّ وَالْحَزَنِ، وَالْعَجْزِ وَالْكَسَلِ، وَالْبُخْلِ وَالْجُبْنِ، وَ ضَلَعِ الدَّيْنِ، وَغَلَبَةِ الرِّجَالِ',
    'أَمْسَيْتُ أَثْنِي عَلَيْكَ حَمْدًا، وَأَشْهَدُ أَنْ لَا إِلَهَ إِلَّا الله',
    'اللّهُـمَّ عالِـمَ الغَـيْبِ وَالشّـهادَةِ فاطِـرَ السّماواتِ وَالأرْضِ رَبَّ كـلِّ شَـيءٍ وَمَليـكَه ، أَشْهَـدُ أَنْ لا إِلـهَ إِلاّ أَنْت ، أَعـوذُ بِكَ مِن شَـرِّ نَفْسـي وَمِن شَـرِّ الشَّيْـطانِ وَشِرْكِهِ ، وَأَنْ أَقْتَـرِفَ عَلـى نَفْسـي سوءاً أَوْ أَجُـرَّهُ إِلـى مُسْـلِم',
    'اللّهُـمَّ إِنِّـي أَمسيتُ أُشْـهِدُك ، وَأُشْـهِدُ حَمَلَـةَ عَـرْشِـك ، وَمَلَائِكَتَكَ ، وَجَمـيعَ خَلْـقِك ، أَنَّـكَ أَنْـتَ اللهُ لا إلهَ إلاّ أَنْـتَ وَحْـدَكَ لا شَريكَ لَـك ، وَأَنَّ ُ مُحَمّـداً عَبْـدُكَ وَرَسـولُـك',
    'حَسْبِـيَ اللّهُ لا إلهَ إلاّ هُوَ عَلَـيهِ تَوَكَّـلتُ وَهُوَ رَبُّ العَرْشِ العَظـيم',
    'اللّهُـمَّ بِكَ أَمْسَـينا وَبِكَ أَصْـبَحْنا، وَبِكَ نَحْـيا وَبِكَ نَمُـوتُ وَإِلَـيْكَ الْمَصِيرُ',
    'سُبْحـانَ اللهِ وَبِحَمْـدِهِ عَدَدَ خَلْـقِه ، وَرِضـا نَفْسِـه ، وَزِنَـةَ عَـرْشِـه ، وَمِـدادَ كَلِمـاتِـه',
    'أَمْسَيْنَا عَلَى فِطْرَةِ الإسْلاَمِ، وَعَلَى كَلِمَةِ الإِخْلاَصِ، وَعَلَى دِينِ نَبِيِّنَا مُحَمَّدٍ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، وَعَلَى مِلَّةِ أَبِينَا إبْرَاهِيمَ حَنِيفاً مُسْلِماً وَمَا كَانَ مِنَ المُشْرِكِينَ',
    'يَا حَيُّ يَا قيُّومُ بِرَحْمَتِكَ أسْتَغِيثُ أصْلِحْ لِي شَأنِي كُلَّهُ وَلاَ تَكِلْنِي إلَى نَفْسِي طَـرْفَةَ عَيْنٍ',
    'اللّهُـمَّ عافِـني في بَدَنـي ، اللّهُـمَّ عافِـني في سَمْـعي ، اللّهُـمَّ عافِـني في بَصَـري ، لا إلهَ إلاّ أَنْـتَ ، اللّهُـمَّ إِنّـي أَعـوذُ بِكَ مِنَ الْكُـفر ، وَالفَـقْر ، وَأَعـوذُ بِكَ مِنْ عَذابِ القَـبْر ، لا إلهَ إلاّ أَنْـتَ',
    'سُبْحـانَ الله',
    'الْحَمْدُ لِلَّه',
    'الْلَّهُ أَكْبَر',
    'سُبْحَانَ اللَّهِ وَبِحَمْدِه',
    'أَسْتَغْفِرُ اللَّهَ وَأَتُوبُ إِلَيْه',
  ];

  List<String> fadhelAlmsaaShort = [
    '[من قالها حين يمسي أجير من الجن إلى أن يصبح]',
    '[من قرأ آيتين من آخر سورة البقرة في ليلة كفتاه]',
    '[من قالها ثلاثا حين يمسى كفته من كل شىء (الإخلاص والمعوذتين)]',
    '[من قالها ثلاثا حين يمسى كفته من كل شىء (الإخلاص والمعوذتين)]',
    '[من قالها ثلاثا حين يمسى كفته من كل شىء (الإخلاص والمعوذتين)]',
    '[من قالها حين يمسي ثلاثا، لم تصبه فجأة بلاء حتى يصبح]',
    '[من قالها حين يمسي ثلاثا، كفاه اللَّه شرار خلقه]',
    '[من قالها ثلاثا حين يمسى، كان حقا على الله أن يرضيه يوم القيامة]',
    '[من قالها موقنا بها حين يمسى ومات من ليلته كان من أهل الجنة]',
    '',
    '',
    '[من قالها حين يمسي، أذهب الله همه وقضى عنه دينه]',
    '',
    '',
    '[من قالها أربعًا حين يمسي أعتقه الله من النار]',
    '[من قالها سبع مرات كفاه الله ما أهمه من أمر الدنيا والأخرة]',
    '',
    '', //18
    '',
    '',
    '',
    '[من سبح مئة مرة قبل غروب الشمس، كان أفضل من مئة بدنة]',
    '[من حمد الله مئة مرة قبل غروب الشمس، كان أفضل من مئة فرس يٌحمل عليها في سبيل الله]',
    '[من كبر الله مئة مرة قبل غروب الشمس، كان أفضل من عتق مئة رقبة]',
    '[من قالها حين يمسي، لم يأت أحد يوم القيامة بأفضل مما جاء به إلا أحد قال مثله أو زاد عليه]',
    '',
  ];

    List<String> fadhelAlmsaa = [
    'عن أُبيِّ بنِ كَعْبٍ رضِي اللهُ عنه أنَّه كان له جُرْنٌ من تَمْرٍ فكان يَنقُصُ فحرسَه ذاتَ ليلةٍ فإذا هو بدابَّةٍ شِبْه الغُلامِ المُحتَلِمِ فسلَّمَ عليه فرَدَّ عليه السلامَ فقال ما أنت جِنِّيٌ أمْ إنْسيٌ قال جِنِّيٌ قال فناوِلْنِي يدَك قال فناوَلَه يدَه فإذا يدُه يدُ كلبٍ وشَعرُه شَعرُ كلبٍ قال هذا خَلْقُ الجِنِّ قال قدْ عَلِمتِ الجِنُّ أنَّ ما فيِهم رجلًا أشدَ مِنِّي قال فما جاء بِكَ قال بلَغَنَا أنَّكَ تُحِبُّ الصَّدقةَ فجِئْنا نُصيبُ من طعامِك قال فما يُنَجِّينَا مِنكُم قال هذه الآيةُ التِي في سورةِ البقرةِ  اللَّهُ لا إِلَهَ إِلَّا هو الْحَيُّ الْقَيُّومُ  مَنْ قالَها حِينَ يُمسِي أُجِيرَ مِنَّا حتَى يُصْبِحَ ومَن قالَها حينَ يصبحُ أُجِيرَ مِنَّا حتى يُمسِي فلَمَّا أصبحَ أتَى رسولُ اللهِ  صلَّى اللهُ عليِه وسلَّمَ فذكر ذلكَ له فقال : صَدَقَ الخبيثُ'
    '\n\nخلاصة حكم المحدث: صحيح'
    '\nالراوي: أبي بن كعب'
    '\nالمحدث: الألباني'
    '\nالمصدر: صحيح الترغيب',
    'مَن قَرَأَ بالآيَتَيْنِ [يعني : مَن قَرَأَ بالآيَتَيْنِ مِن آخِرِ سُورَةِ البَقَرَةِ في لَيْلَةٍ كَفَتَاهُ]'
    '\n\nخلاصة حكم المحدث: صحيح'
    '\nالراوي: أبو مسعود'
    '\nالمحدث: البخاري'
    '\nالمصدر: صحيح البخاري',
    'عن عبدالله بن خبيب رضي الله عنه قال: خرجنا في ليلةٍ مطيرةٍ وظلمةٍ شديدةٍ نطلبُ رسولَ اللهِ صلَّى اللهُ عليه وسلَّمَ يصلي لنا قال فأدركْتُه فقال قل فلم أقُلْ شيئًا ثم قال قل فلمْ أقُلْ شيئًا قال قل فقلتُ ما أقول قال قُلْ هُوَ اللهُ أَحَدٌ والمعوِّذتَين حين تُمسي وتصبحُ ثلاثَ مراتٍ تكفِيك من كلِّ شيءٍ'
    '\n\nخلاصة حكم المحدث: حسن'
    '\nالراوي: عبدالله بن خبيب'
    '\nالمحدث: الألباني'
    '\nالمصدر: صحيح الترمذي',
    'راجع دليل سورة الاخلاص',
    'راجع دليل سورة الاخلاص',
    'عن عُثْمَانَ بْنَ عَفَّان رضي الله عنه قال: قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم:(مَن قال: باسمِ اللهِ الذي لا يضُرُّ مع اسْمِه شَيءٌ في الأرضِ، ولا في السَّماءِ، وهو السَّميعُ العَليمُ، ثلاثَ مرَّاتٍ، لم تُصِبْه فَجْأةُ بَلاءٍ حتى يُصبِحَ، ومَن قالَها حين يُصبِحُ، ثلاثَ مرَّاتٍ، لم تُصِبْه فَجْأةُ بَلاءٍ حتى يُمسي'
    ')\n\nخلاصة حكم المحدث: حسن'
    '\nالراوي: عثمان بن عفان'
    '\nالمحدث: شعيب الأرناؤوط'
    '\nالمصدر: سنن أبي داود',
    'عن أبي هريرة رضي الله عنه، أنه قال: جَاءَ رَجُلٌ إلى النَّبيِّ صَلَّى اللَّهُ عليه وَسَلَّمَ فَقالَ: يا رَسولَ اللهِ، ما لَقِيتُ مِن عَقْرَبٍ لَدَغَتْنِي البَارِحَةَ، قالَ: أَمَا لو قُلْتَ حِينَ أَمْسَيْتَ: أَعُوذُ بكَلِمَاتِ اللهِ التَّامَّاتِ مِن شَرِّ ما خَلَقَ، لَمْ تَضُرَّكَ.'
    '\n\nخلاصة حكم المحدث: صحيح'
    '\nالراوي: أبو هريرة'
    '\nالمحدث: مسلم'
    '\nالمصدر: صحيح مسلم',
    'عن أبي سَلَّامٍ قال: كُنَّا قُعودًا في مَسجِدِ حِمصَ، إذ مَرَّ رَجُلٌ فقالوا: هذا خَدَمَ رسولَ اللهِ صلَّى اللهُ عليه وسلَّمَ، قال: فنَهَضتُ فسَأَلتُه فقُلتُ: حَدِّثْنا بما سَمِعتَ من رسولِ اللهِ صلَّى اللهُ عليه وسلَّمَ لم يَتَداوَلْه الرِّجالُ فيما بيْنَكما، قال: سَمِعتُ رسولَ اللهِ صلَّى اللهُ عليه وسلَّمَ يقولُ: ما مِن عبدٍ مُسلِمٍ يقولُ ثلاثَ مرَّاتٍ حين يُمْسي أو يُصبِحُ: رَضيتُ باللهِ رَبًّا، وبالإسلامِ دِينًا، وبمُحمَّدٍ نبيًّا؛ إلَّا كان حقًّا على اللهِ أنْ يُرضِيَه يَومَ القيامةِ.'
    '\n\nخلاصة حكم المحدث: صحيح لغيره'
    '\nالراوي: رجال من الصحابة '
    '\nالمحدث: شعيب الأرناؤوط'
    '\nالمصدر: المسند لشعيب',
    'عَنْ شَدَّادِ بْنِ أَوْسِ رضي الله عنه قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «سَيِّدُ الِاسْتِغْفارِ أنْ تَقُولَ: اللَّهُمَّ أنْتَ رَبِّي لا إلَهَ إلَّا أنْتَ، خَلَقْتَنِي وأنا عَبْدُكَ، وأنا علَى عَهْدِكَ ووَعْدِكَ ما اسْتَطَعْتُ، أعُوذُ بكَ مِن شَرِّ ما صَنَعْتُ، أبُوءُ لكَ بنِعْمَتِكَ عَلَيَّ، وأَبُوءُ لكَ بذَنْبِي فاغْفِرْ لِي؛ فإنَّه لا يَغْفِرُ الذُّنُوبَ إلَّا أنْتَ». قال: «قالَ: ومَن قالَها مِنَ النَّهارِ مُوقِنًا بها، فَماتَ مِن يَومِهِ قَبْلَ أنْ يُمْسِيَ، فَهو مِن أهْلِ الجَنَّةِ، ومَن قالَها مِنَ اللَّيْلِ وهو مُوقِنٌ بها، فَماتَ قَبْلَ أنْ يُصْبِحَ، فَهو مِن أهْلِ الجَنَّةِ »'
    '\n\nخلاصة حكم المحدث: صحيح'
    '\nالراوي: شداد بن أوس'
    '\nالمحدث: البخاري'
    '\nالمصدر: صحيح البخاري',
    'عن عبدالله بن مسعود رضي الله عنه، قال: كانَ نَبِيُّ اللهِ صَلَّى اللَّهُ عليه وَسَلَّمَ، إذَا أَمْسَى قالَ: أَمْسَيْنَا وَأَمْسَى المُلْكُ لِلَّهِ، وَالْحَمْدُ لِلَّهِ لا إلَهَ إلَّا اللَّهُ، وَحْدَهُ لا شَرِيكَ له قالَ: أُرَاهُ قالَ فِيهِنَّ: له المُلْكُ وَلَهُ الحَمْدُ وَهو علَى كُلِّ شيءٍ قَدِيرٌ، رَبِّ أَسْأَلُكَ خَيْرَ ما في هذِه اللَّيْلَةِ وَخَيْرَ ما بَعْدَهَا، وَأَعُوذُ بكَ مِن شَرِّ ما في هذِه اللَّيْلَةِ وَشَرِّ ما بَعْدَهَا، رَبِّ أَعُوذُ بكَ مِنَ الكَسَلِ وَسُوءِ الكِبَرِ، رَبِّ أَعُوذُ بكَ مِن عَذَابٍ في النَّارِ وَعَذَابٍ في القَبْرِ وإذَا أَصْبَحَ قالَ ذلكَ أَيْضًا: أَصْبَحْنَا وَأَصْبَحَ المُلْكُ لِلَّهِ'
    '\n\nخلاصة حكم المحدث: صحيح'
    '\nالراوي: عبدالله بن مسعود'
    '\nالمحدث: مسلم'
    '\nالمصدر: صحيح مسلم',
    'عن عبدالله بن عمر رضي الله عنه قال: لم يكنْ رسولُ اللهِ صلى الله عليه وسلم يَدَعُ هؤلاء الدعواتِ حينَ يُمسي، وحينَ يُصبِحُ :اللهم إني أسألُك العافيةَ في الدنيا والآخرةِ، اللهم إني أسألُك العفوَ والعافيةَ في ديني ودنياي وأهلي ومالي، اللهم استرْ عورتي وآمنْ روعاتي، اللهم احفظْني مِن بين يديَّ ومن خلفي وعن يميني وعن شمالي ومن فوقي، وأعوذُ بعظمتِك أن أُغتالَ مِن تحتي'
    '\n\nخلاصة حكم المحدث: صحيح'
    '\nالراوي: عبدالله بن عمر'
    '\nالمحدث: الألباني'
    '\nالمصدر: صحيح أبي داود',
    'كان النَّبيُّ صلَّى اللهُ عليه وسلَّمَ يقولُ: (اللَّهمَّ إنِّي أعوذُ بكَ مِن العَجزِ والكَسَلِ، والهَمِّ والحَزَنِ، والجُبنِ والبُخلِ، وضَلَعِ الدَّينِ وغَلَبةِ الرِّجالِ) صحيح البخاري(2893)'
    '\n\nخلاصة حكم المحدث: صحيح'
    '\nالراوي: أنس بن مالك'
    '\nالمحدث: ابن حجر العسقلاني'
    '\nالمصدر: الفتوحات الربانية',
    'عَنْ أَبِي هُرَيْرَةَ رضي الله عنه، قَالَ: قَالَ رَسُولُ اللهِ صلى الله عليه وسلم: (إذا أصبَحَ أحدُكم فليقُلْ : أصبحتُ أثنيَ عليكَ حمدًا، وأشهدُ أن لا إلَه إلَّا اللَّهُ ثلاثًا وإذا أمسى فليقُلْ مثلَ ذلِك)'
    '\n\nخلاصة حكم المحدث: حسن'
    '\nالراوي: أبو هريرة'
    '\nالمحدث: الوادعي'
    '\nالمصدر: الصحيح المسند',
    'عَنْ أَبِي هُرَيْرَةَ رضي الله عنه قَالَ:أنَّ أبا بَكرٍ الصِّدِّيقَ رَضيَ اللهُ عنه قال: يا رَسولَ اللهِ، مُرْني بكَلِماتٍ أقولُهُنَّ إذا أصبَحتُ، وإذا أمسَيتُ. قال: (قُلِ: اللَّهمَّ فاطِرَ السَّمَواتِ والأرضِ، عالِمَ الغَيبِ والشَّهادةِ، رَبَّ كُلِّ شَيءٍ ومَليكَه، أشهَدُ أنْ لا إلهَ إلَّا أنتَ، أعوذُ بِكَ مِن شَرِّ نَفْسي ومِن شَرِّ الشَّيطانِ وشِركِه. قال: قُلْها إذا أصبَحتَ وإذا أمسَيتَ وإذا أخَذتَ مَضجَعَكَ)'
    '\n\nخلاصة حكم المحدث: صحيح'
    '\nالراوي: أبو هريرة'
    '\nالمحدث: ابن دقيق'
    '\nالمصدر: الاقتراح في بيان الاصطلاح',
    'عن أنس بن مالك رضي الله عنه، أَنَّ رَسُولَ اللهٍ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، قالَ:(من قال حين يصبحُ أو يمسي: اللهمَّ إني أصبحتُ أشهدُكَ وأشهدُ حملةَ عرشِكَ، وملائكتَكَ وجميعَ خلقِك بأنَّك أنت اللهُ لا إلهَ إلا أنتَ وحدك لا شريكَ لك، وأنَّ محمَّدًا عبدُك ورسولُك أعتقَ اللهُ ربُعَه من النَّارِ، ومن قالها مرَّتين أعتقَ اللهُ نصفَه من النَّارِ، ومن قالها ثلاثًا أعتقَ اللهُ ثلاثةَ أرباعِه من النَّارِ، فإن قالها أربعًا أعتقَه اللهُ من النَّارِ)'
    '\n\nخلاصة حكم المحدث: إسناده حسن'
    '\nالراوي: أنس بن مالك'
    '\nالمحدث: ابن باز'
    '\nالمصدر: مجموع فتاوى ابن باز',
    'عن أبي الدرداءِ قال: من قال إذا أصبح وإذا أمسَى : حسبِيَ اللهُ لا إلهَ إلا هو عليه توكلتُ وهو ربُّ العرشِ العظيمِ سبعَ مراتٍ كفاه اللهُ ما أهمَّه'
    '\n\nخلاصة حكم المحدث: موقوف إسناده جيد'
    '\nالمحدث: ابن باز'
    '\nالمصدر: مجموع فتاوى ابن باز',
    'عن النبيِّ صلَّى اللهُ عليهِ وسلَّمَ أنه كان يعلِّمُ أصحابَه يقولُ إذا أصبحَ أحدُكم فليقلْ: اللهمَّ بك أصبحنا وبك أمسينا وبك نحيا وبك نموتُ وإليك النُّشورُ، وإذا أمسى فليقلِ اللهمَّ بك أمسينا وبك أصبحنا وبك نحيا وبك نموتُ وإليك المصيرُعن النبيِّ صلَّى اللهُ عليهِ وسلَّمَ أنه كان يعلِّمُ أصحابَه يقولُ إذا أصبحَ أحدُكم فليقلْ: اللهمَّ بك أصبحنا وبك أمسينا وبك نحيا وبك نموتُ وإليك النُّشورُ، وإذا أمسى فليقلِ اللهمَّ بك أمسينا وبك أصبحنا وبك نحيا وبك نموتُ وإليك المصيرُ'
    '\n\nخلاصة حكم المحدث: إسناده صحيح'
    '\nالراوي: أبو هريرة'
    '\nالمحدث: ابن باز'
    '\nالمصدر: فتاوى ابن باز',
    'عن جويرية بنت الحارث رضي الله عنها قالت: قال لي رسول الله صلى الله عليه وسلم: لقَدْ قُلتُ بَعْدَكِ أَرْبَعَ كَلِمَاتٍ ثَلَاثَ مَرَّاتٍ، لو وُزِنَتْ بما قُلْتِ مُنْذُ اليَومِ لَوَزَنَتْهُنَّ: سُبْحَانَ اللهِ وَبِحَمْدِهِ، عَدَدَ خَلْقِهِ، وَرِضَا نَفْسِهِ، وَزِنَةَ عَرْشِهِ، وَمِدَادَ كَلِمَاتِهِ'
    '\n\nخلاصة حكم المحدث: صحيح'
    '\nالراوي: جويرية بنت الحارث أم المؤمنين'
    '\nالمحدث: مسلم'
    '\nالمصدر: صحيح مسلم',
    'كان رسولُ اللهِ صلَّى اللهُ عليه وسلَّمَ إذا أَصبَحَ يقولُ: أَصبَحْنا على فِطرةِ الإسلامِ، وكَلِمةِ الإخلاصِ، ودِينِ نَبيِّنا محمَّدٍ صلَّى اللهُ عليه وسلَّمَ، وعلى مِلَّةِ أبِينا إبراهيمَ، حَنيفًا مُسلِمًا، وما كان مِنَ المُشرِكينَ'
    '\n\nخلاصة حكم المحدث: صحيح'
    '\nالراوي: عبدالرحمن بن أبزى'
    '\nالمحدث: شعيب الأرناؤوط'
    '\nالمصدر: تخريج المسند لشعيب',
    'عن أنس بن مالك رضي الله عنه قال: قال النبي صلى الله عليه وسلم لفاطمة: (ما يَمنعُكِ أنْ تسمَعِي ما أُوصِيكِ بهِ ؟ أنْ تقولِي إذا أصبحتِ وإذا أمسيْتِ : يا حيُّ يا قيُّومُ برحمتِكَ أستغيثُ، أصلِحْ لِي شأنِي كلَّهُ، ولا تكِلْنِي إلى نفسِي طرْفةَ عيْنٍ)'
    '\n\nخلاصة حكم المحدث: حسن'
    '\nالراوي: أنس بن مالك'
    '\nالمحدث: الألباني '
    '\nالمصدر: صحيح الجامع',
    'عن عبدِ الرَّحمنِ بنِ أبي بَكْرةَ أنَّه قال لأبيه: يا أبتِ إنِّي أسمعُك تدعوه كُلَّ غداةٍ: اللَّهُمَّ عافِني في بَدَني، اللَّهُمَّ عافِني في سمعي، اللَّهُمَّ عافِني في بَصَري، اللَّهُمَّ إنِّي أعوذُ بك من الكُفرِ والفَقرِ، اللَّهُمَّ إنِّي أعوذُ بك من عذابِ القبرِ، لا إلهَ إلَّا أنت، تُعيدُها حين تُصبِحُ ثلاثًا، وثلاثًا حين تُمسي، فقال: إنِّي سمعتُ رَسولَ اللهِ صلَّى اللهُ عليه وسلَّم يدعو بهنَّ؛ فأنا أحِبُّ أن أستَنَّ بسُنَّتِه'
    '\n\nخلاصة حكم المحدث: حسن'
    '\nالراوي: أبو بكرة نفيع بن الحارث'
    '\nالمحدث: ابن حجر العسقلاني '
    '\nالمصدر: الفتوحات الربانية',
    'عَنْ عَمْرِو بْنِ شَعَيْبِ، عَنْ أَبِيهِ، عَنْ جَدِّهِ، قَالَ: قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: من قال : ( سبحان اللهِ ) مئةَ مرةٍ قبل طلوعِ الشمسِ وقبل غروبِها؛ كان أفضلَ من مئةِ بدنةٍ، ومن قال : ( الحمدُ لله ) مئةَ مرةٍ قبلَ طلوعِ الشمسِ وقبلَ غروبِها؛ كان أفضلَ من مئةِ فرسٍ يُحمَلُ عليها في سبيلِ اللهِ، ومن قال : ( اللهُ أكبرُ ) مئةَ مرةٍ، قبلَ طلوعِ الشمسِ وقبلَ غروبِها، كان أفضلَ من عتقِ مئةِ رقبةٍ، ومن قال : ( لا إله إلا اللهُ وحده لا شريك له، له الملكُ، وله الحمدُ، وهو على كلِّ شيءٍ قديرٌ ) مئةَ مرةٍ قبلَ طلوعِ الشمسِ وقبلَ غروبها، لم يَجيءْ يومَ القيامةِ أَحَدٌ بعملٍ أفضلَ من عملِه، إلا من قال مثلَ قوْلِه، أو زاد عليه'
    '\n\nخلاصة حكم المحدث: حسن'
    '\nالراوي: [جد عمرو بن شعيب]'
    '\nالمحدث: الألباني '
    '\nالمصدر: صحيح الترغيب',
    'راجع دليل سبحان الله',
    'راجع دليل سبحان الله',
    'عَنْ أَبِي هُرَيْرَةَ رضي الله عنه، قَالَ: قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: (مَنْ قال حِينَ يُصبِحُ و حِينَ يُمسِي : سُبحانَ اللهِ العظيمِ و بِحمدِهِ ، مِائةَ مَرَّةٍ ، لمْ يأتِ أحدٌ يومَ القِيامةِ بأفْضلَ مِمَّا جاء به ، إلَّا أحَدٌ قال مِثلَ ذلِكَ ، و زادَ عليْهِ) صحيح مسلم(2692)'
    '\n\nخلاصة حكم المحدث: صحيح'
    '\nالراوي: أبو هريرة'
    '\nالمحدث: الألباني'
    '\nالمصدر: صحيح الجامع'
    '\n\n'
    'وعَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ: أَنَّ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: (من قال : سبحان اللهِ وبحمدِه مائةَ مرةٍ غُفرَتْ له ذنوبُه وإنْ كانتْ مثلَ زبَدِ البحرِ) صحيح البخاري(6405)'
    '\n\nخلاصة حكم المحدث: صحيح'
    '\nالراوي: أبو هريرة'
    '\nالمحدث: الألباني'
    '\nالمصدر: صحيح الترمذي',
    'عَنْ أَبِي مُوسَى رَضِيَ اللهُ عَنْهُ قَالَ: قَالَ رسول الله صلى الله عليه وسلم: (ما أصبحْتُ غداةً قطُّ إلَّا استغفرتُ اللهَ تعالى فيها مائةَ مرةٍ)'
    '\n\nخلاصة حكم المحدث: صحيح'
    '\nالراوي: أبو موسى الأشعري'
    '\nالمحدث: الألباني'
    '\nالمصدر: صحيح الجامع\n\n'
    'وعَنْ أَبِي هُرَيْرَةَ رضي الله عنه قَالَ: قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: (إنِّي لأستغفرُ اللهَ وأتوبُ إليهِ في اليومِ مائةَ مرةٍ)'
    '\n\nخلاصة حكم المحدث: حسن صحيح'
    '\nالراوي: أبو هريرة'
    '\nالمحدث: الألباني'
    '\nالمصدر: صحيح ابن ماجه',
];

List<int> almsaaCounter = [
    1,1,3,3,3,3,3,3,1,1,1,1,3,1,4,7,1,3,1,1,3,100,100,100,100,100
  ];
//-----------------------------------------------------------------------------------------------------
  List<String> alsabah = [
    'أَعُوذُ بِاللهِ مِنْ الشَّيْطَانِ الرَّجِيمِ\n'
    '﴿اللَّهُ لا إِلهَ إِلّا هُوَ الحَيُّ القَيّومُ لا تَأخُذُهُ سِنَةٌ وَلا نَومٌ لَهُ ما فِي السَّماواتِ وَما فِي الأَرضِ مَن ذَا الَّذي يَشفَعُ عِندَهُ إِلّا بِإِذنِهِ يَعلَمُ ما بَينَ أَيديهِم وَما خَلفَهُم وَلا يُحيطونَ بِشَيءٍ مِن عِلمِهِ إِلّا بِما شاءَ وَسِعَ كُرسِيُّهُ السَّماواتِ وَالأَرضَ وَلا يَئودُهُ حِفظُهُما وَهُوَ العَلِيُّ العَظيمُ﴾'
    ' [البقرة:255]',
    '{بِسْمِ اللهِ الرَّحْمنِ الرَّحِيم}\n'
    '﴿قُل هُوَ اللَّهُ أَحَدٌ۝اللَّهُ الصَّمَدُ۝لَم يَلِد وَلَم يولَد۝وَلَم يَكُن لَهُ كُفُوًا أَحَدٌ﴾'
    ' [الإخلاص: 1-4]',
    '{بِسْمِ اللهِ الرَّحْمنِ الرَّحِيم}\n'
    '﴿قُل أَعوذُ بِرَبِّ الفَلَقِ۝مِن شَرِّ ما خَلَقَ۝وَمِن شَرِّ غاسِقٍ إِذا وَقَبَ۝وَمِن شَرِّ النَّفّاثاتِ فِي العُقَدِ۝وَمِن شَرِّ حاسِدٍ إِذا حَسَدَ﴾'
    ' [الفلق: 1-5]',
    '{بِسْمِ اللهِ الرَّحْمنِ الرَّحِيم}\n'
    '﴿قُل أَعوذُ بِرَبِّ النّاسِ۝مَلِكِ النّاسِ۝إِلهِ النّاسِ۝مِن شَرِّ الوَسواسِ الخَنّاسِ۝الَّذي يُوَسوِسُ في صُدورِ النّاسِ۝مِنَ الجِنَّةِ وَالنّاسِ﴾'
    ' [الناس: 1-6]',
    'بِسـمِ اللهِ الذي لا يَضُـرُّ مَعَ اسمِـهِ شَيءٌ في الأرْضِ وَلا في السّمـاءِ وَهـوَ السّمـيعُ العَلـيم',
    'أَعـوذُ بِكَلِمـاتِ اللّهِ التّـامّـاتِ مِنْ شَـرِّ ما خَلَـق',
    'رَضيـتُ بِاللهِ رَبَّـاً وَبِالإسْلامِ ديـناً وَبِمُحَـمَّدٍ صلى الله عليه وسلم نَبِيّـاً',
    'اللّهـمَّ أَنْتَ رَبِّـي لا إلهَ إلاّ أَنْتَ ، خَلَقْتَنـي وَأَنا عَبْـدُك ، وَأَنا عَلـى عَهْـدِكَ وَوَعْـدِكَ ما اسْتَـطَعْـت ، أَعـوذُبِكَ مِنْ شَـرِّ ما صَنَـعْت ، أَبـوءُ لَـكَ بِنِعْـمَتِـكَ عَلَـيَّ وَأَبـوءُ بِذَنْـبي فَاغْفـِرْ لي فَإِنَّـهُ لا يَغْـفِرُ الذُّنـوبَ إِلاّ أَنْتَ',
    'أَصْـبَحْنا وَأَصْـبَحَ المُـلْكُ لله وَالحَمدُ لله ، لا إلهَ إلاّ اللّهُ وَحدَهُ لا شَريكَ لهُ، لهُ المُـلكُ ولهُ الحَمْـد، وهُوَ على كلّ شَيءٍ قدير ، رَبِّ أسْـأَلُـكَ خَـيرَ ما في هـذا اليوم وَخَـيرَ ما بَعْـدَه ، وَأَعـوذُ بِكَ مِنْ شَـرِّ ما في هـذا اليوم وَشَرِّ ما بَعْـدَه، رَبِّ أَعـوذُبِكَ مِنَ الْكَسَـلِ وَسـوءِ الْكِـبَر ، رَبِّ أَعـوذُ بِكَ مِنْ عَـذابٍ في النّـارِ وَعَـذابٍ في القَـبْر',
    'اللّهُـمَّ إِنِّـي أسْـأَلُـكَ العَـفْوَ وَالعـافِـيةَ في الدُّنْـيا وَالآخِـرَة ، اللّهُـمَّ إِنِّـي أسْـأَلُـكَ العَـفْوَ وَالعـافِـيةَ في ديني وَدُنْـيايَ وَأهْـلي وَمالـي ، اللّهُـمَّ اسْتُـرْ عـوْراتي وَآمِـنْ رَوْعاتـي ، اللّهُـمَّ احْفَظْـني مِن بَـينِ يَدَيَّ وَمِن خَلْفـي وَعَن يَمـيني وَعَن شِمـالي ، وَمِن فَوْقـي ، وَأَعـوذُ بِعَظَمَـتِكَ أَن أُغْـتالَ مِن تَحْتـي',
    'اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ الْهَمِّ وَالْحَزَنِ، وَالْعَجْزِ وَالْكَسَلِ، وَالْبُخْلِ وَالْجُبْنِ، وَ ضَلَعِ الدَّيْنِ، وَغَلَبَةِ الرِّجَالِ',
    'أَصْبَحْتُ أَثْنِي عَلَيْكَ حَمْدًا، وَأَشْهَدُ أَنْ لَا إِلَهَ إِلَّا الله',
    'اللّهُـمَّ عالِـمَ الغَـيْبِ وَالشّـهادَةِ فاطِـرَ السّماواتِ وَالأرْضِ رَبَّ كـلِّ شَـيءٍ وَمَليـكَه ، أَشْهَـدُ أَنْ لا إِلـهَ إِلاّ أَنْت ، أَعـوذُ بِكَ مِن شَـرِّ نَفْسـي وَمِن شَـرِّ الشَّيْـطانِ وَشِرْكِهِ ، وَأَنْ أَقْتَـرِفَ عَلـى نَفْسـي سوءاً أَوْ أَجُـرَّهُ إِلـى مُسْـلِم',
    'اللّهُـمَّ إِنِّـي أَصْبَحْتُ أُشْـهِدُك ، وَأُشْـهِدُ حَمَلَـةَ عَـرْشِـك ، وَمَلَائِكَتَكَ ، وَجَمـيعَ خَلْـقِك ، أَنَّـكَ أَنْـتَ اللهُ لا إلهَ إلاّ أَنْـتَ وَحْـدَكَ لا شَريكَ لَـك ، وَأَنَّ ُ مُحَمّـداً عَبْـدُكَ وَرَسـولُـك',
    'حَسْبِـيَ اللّهُ لا إلهَ إلاّ هُوَ عَلَـيهِ تَوَكَّـلتُ وَهُوَ رَبُّ العَرْشِ العَظـيم',
    'اللّهُـمَّ بِكَ أَصْـبَحْنا وَبِكَ أَمْسَـينا، وَبِكَ نَحْـيا وَبِكَ نَمُـوتُ وَإِلَـيْكَ النُّشُور',
    'سُبْحـانَ اللهِ وَبِحَمْـدِهِ عَدَدَ خَلْـقِه ، وَرِضـا نَفْسِـه ، وَزِنَـةَ عَـرْشِـه ، وَمِـدادَ كَلِمـاتِـه',
    'أَصْبَحْنا عَلَى فِطْرَةِ الإسْلاَمِ، وَعَلَى كَلِمَةِ الإِخْلاَصِ، وَعَلَى دِينِ نَبِيِّنَا مُحَمَّدٍ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، وَعَلَى مِلَّةِ أَبِينَا إبْرَاهِيمَ حَنِيفاً مُسْلِماً وَمَا كَانَ مِنَ المُشْرِكِينَ',
    'يَا حَيُّ يَا قيُّومُ بِرَحْمَتِكَ أسْتَغِيثُ أصْلِحْ لِي شَأنِي كُلَّهُ وَلاَ تَكِلْنِي إلَى نَفْسِي طَـرْفَةَ عَيْنٍ',
    'اللّهُـمَّ عافِـني في بَدَنـي ، اللّهُـمَّ عافِـني في سَمْـعي ، اللّهُـمَّ عافِـني في بَصَـري ، لا إلهَ إلاّ أَنْـتَ ، اللّهُـمَّ إِنّـي أَعـوذُ بِكَ مِنَ الْكُـفر ، وَالفَـقْر ، وَأَعـوذُ بِكَ مِنْ عَذابِ القَـبْر ، لا إلهَ إلاّ أَنْـتَ',
    'سُبْحـانَ الله',
    'الْحَمْدُ لِلَّه',
    'الْلَّهُ أَكْبَر',
    'سُبْحَانَ اللَّهِ وَبِحَمْدِه',
    'أَسْتَغْفِرُ اللَّهَ وَأَتُوبُ إِلَيْه',
  ];

  List<String> fadhelAlsabahShort = [
    '[من قالها حين يصبح أجير من الجن إلى أن يمسي]',
    '[من قالها ثلاثا حين يصبح كفته من كل شىء (الإخلاص والمعوذتين)]',
    '[من قالها ثلاثا حين يصبح كفته من كل شىء (الإخلاص والمعوذتين)]',
    '[من قالها ثلاثا حين يصبح كفته من كل شىء (الإخلاص والمعوذتين)]',
    '[من قالها حين يصبح ثلاثا، لم تصبه فجأة بلاء حتى يمسي]',
    '',
    '[من قالها ثلاثا حين يصبح، كان حقا على الله أن يرضيه يوم القيامة]',
    '[من قالها موقنا بها حين يصبح ومات من يومه كان من أهل الجنة]',
    '',
    '',
    '[من قالها حين يصبح، أذهب الله همه وقضى عنه دينه]',
    '',
    '',
    '[من قالها أربعًا حين يصبح أعتقه الله من النار]',
    '[من قالها سبع مرات كفاه الله ما أهمه من أمر الدنيا والأخرة]',
    '',
    '', 
    '',
    '',
    '',
    '[من سبح مئة مرة قبلَ طلوعِ الشمسِ، كان أفضل من مئة بدنة]',
    '[من حمد الله مئة مرة قبلَ طلوعِ الشمسِ، كان أفضل من مئة فرس يٌحمل عليها في سبيل الله]',
    '[من كبر الله مئة مرة قبلَ طلوعِ الشمسِ، كان أفضل من عتق مئة رقبة]',
    '[من قالها حين يصبح، لم يأت أحد يوم القيامة بأفضل مما جاء به إلا أحد قال مثله أو زاد عليه]',
    '',
  ];

  List<String> fadhelAlsabah = [
    'عن أُبيِّ بنِ كَعْبٍ رضِي اللهُ عنه أنَّه كان له جُرْنٌ من تَمْرٍ فكان يَنقُصُ فحرسَه ذاتَ ليلةٍ فإذا هو بدابَّةٍ شِبْه الغُلامِ المُحتَلِمِ فسلَّمَ عليه فرَدَّ عليه السلامَ فقال ما أنت جِنِّيٌ أمْ إنْسيٌ قال جِنِّيٌ قال فناوِلْنِي يدَك قال فناوَلَه يدَه فإذا يدُه يدُ كلبٍ وشَعرُه شَعرُ كلبٍ قال هذا خَلْقُ الجِنِّ قال قدْ عَلِمتِ الجِنُّ أنَّ ما فيِهم رجلًا أشدَ مِنِّي قال فما جاء بِكَ قال بلَغَنَا أنَّكَ تُحِبُّ الصَّدقةَ فجِئْنا نُصيبُ من طعامِك قال فما يُنَجِّينَا مِنكُم قال هذه الآيةُ التِي في سورةِ البقرةِ  اللَّهُ لا إِلَهَ إِلَّا هو الْحَيُّ الْقَيُّومُ  مَنْ قالَها حِينَ يُمسِي أُجِيرَ مِنَّا حتَى يُصْبِحَ ومَن قالَها حينَ يصبحُ أُجِيرَ مِنَّا حتى يُمسِي فلَمَّا أصبحَ أتَى رسولُ اللهِ  صلَّى اللهُ عليِه وسلَّمَ فذكر ذلكَ له فقال : صَدَقَ الخبيثُ'
    '\n\nخلاصة حكم المحدث: صحيح'
    '\nالراوي: أبي بن كعب'
    '\nالمحدث: الألباني'
    '\nالمصدر: صحيح الترغيب',
    'عن عبدالله بن خبيب رضي الله عنه قال: خرجنا في ليلةٍ مطيرةٍ وظلمةٍ شديدةٍ نطلبُ رسولَ اللهِ صلَّى اللهُ عليه وسلَّمَ يصلي لنا قال فأدركْتُه فقال قل فلم أقُلْ شيئًا ثم قال قل فلمْ أقُلْ شيئًا قال قل فقلتُ ما أقول قال قُلْ هُوَ اللهُ أَحَدٌ والمعوِّذتَين حين تُمسي وتصبحُ ثلاثَ مراتٍ تكفِيك من كلِّ شيءٍ'
    '\n\nخلاصة حكم المحدث: حسن'
    '\nالراوي: عبدالله بن خبيب'
    '\nالمحدث: الألباني'
    '\nالمصدر: صحيح الترمذي',
    'راجع دليل سورة الاخلاص',
    'راجع دليل سورة الاخلاص',
    'عن عُثْمَانَ بْنَ عَفَّان رضي الله عنه قال: قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم:(مَن قال: باسمِ اللهِ الذي لا يضُرُّ مع اسْمِه شَيءٌ في الأرضِ، ولا في السَّماءِ، وهو السَّميعُ العَليمُ، ثلاثَ مرَّاتٍ، لم تُصِبْه فَجْأةُ بَلاءٍ حتى يُصبِحَ، ومَن قالَها حين يُصبِحُ، ثلاثَ مرَّاتٍ، لم تُصِبْه فَجْأةُ بَلاءٍ حتى يُمسي'
    ')\n\nخلاصة حكم المحدث: حسن'
    '\nالراوي: عثمان بن عفان'
    '\nالمحدث: شعيب الأرناؤوط'
    '\nالمصدر: سنن أبي داود',
    '',
    'عن أبي سَلَّامٍ قال: كُنَّا قُعودًا في مَسجِدِ حِمصَ، إذ مَرَّ رَجُلٌ فقالوا: هذا خَدَمَ رسولَ اللهِ صلَّى اللهُ عليه وسلَّمَ، قال: فنَهَضتُ فسَأَلتُه فقُلتُ: حَدِّثْنا بما سَمِعتَ من رسولِ اللهِ صلَّى اللهُ عليه وسلَّمَ لم يَتَداوَلْه الرِّجالُ فيما بيْنَكما، قال: سَمِعتُ رسولَ اللهِ صلَّى اللهُ عليه وسلَّمَ يقولُ: ما مِن عبدٍ مُسلِمٍ يقولُ ثلاثَ مرَّاتٍ حين يُمْسي أو يُصبِحُ: رَضيتُ باللهِ رَبًّا، وبالإسلامِ دِينًا، وبمُحمَّدٍ نبيًّا؛ إلَّا كان حقًّا على اللهِ أنْ يُرضِيَه يَومَ القيامةِ.'
    '\n\nخلاصة حكم المحدث: صحيح لغيره'
    '\nالراوي: رجال من الصحابة '
    '\nالمحدث: شعيب الأرناؤوط'
    '\nالمصدر: المسند لشعيب',
    'عَنْ شَدَّادِ بْنِ أَوْسِ رضي الله عنه قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «سَيِّدُ الِاسْتِغْفارِ أنْ تَقُولَ: اللَّهُمَّ أنْتَ رَبِّي لا إلَهَ إلَّا أنْتَ، خَلَقْتَنِي وأنا عَبْدُكَ، وأنا علَى عَهْدِكَ ووَعْدِكَ ما اسْتَطَعْتُ، أعُوذُ بكَ مِن شَرِّ ما صَنَعْتُ، أبُوءُ لكَ بنِعْمَتِكَ عَلَيَّ، وأَبُوءُ لكَ بذَنْبِي فاغْفِرْ لِي؛ فإنَّه لا يَغْفِرُ الذُّنُوبَ إلَّا أنْتَ». قال: «قالَ: ومَن قالَها مِنَ النَّهارِ مُوقِنًا بها، فَماتَ مِن يَومِهِ قَبْلَ أنْ يُمْسِيَ، فَهو مِن أهْلِ الجَنَّةِ، ومَن قالَها مِنَ اللَّيْلِ وهو مُوقِنٌ بها، فَماتَ قَبْلَ أنْ يُصْبِحَ، فَهو مِن أهْلِ الجَنَّةِ »'
    '\n\nخلاصة حكم المحدث: صحيح'
    '\nالراوي: شداد بن أوس'
    '\nالمحدث: البخاري'
    '\nالمصدر: صحيح البخاري',
    'عن عبدالله بن مسعود رضي الله عنه، قال: كانَ نَبِيُّ اللهِ صَلَّى اللَّهُ عليه وَسَلَّمَ، إذَا أَمْسَى قالَ: أَمْسَيْنَا وَأَمْسَى المُلْكُ لِلَّهِ، وَالْحَمْدُ لِلَّهِ لا إلَهَ إلَّا اللَّهُ، وَحْدَهُ لا شَرِيكَ له قالَ: أُرَاهُ قالَ فِيهِنَّ: له المُلْكُ وَلَهُ الحَمْدُ وَهو علَى كُلِّ شيءٍ قَدِيرٌ، رَبِّ أَسْأَلُكَ خَيْرَ ما في هذِه اللَّيْلَةِ وَخَيْرَ ما بَعْدَهَا، وَأَعُوذُ بكَ مِن شَرِّ ما في هذِه اللَّيْلَةِ وَشَرِّ ما بَعْدَهَا، رَبِّ أَعُوذُ بكَ مِنَ الكَسَلِ وَسُوءِ الكِبَرِ، رَبِّ أَعُوذُ بكَ مِن عَذَابٍ في النَّارِ وَعَذَابٍ في القَبْرِ وإذَا أَصْبَحَ قالَ ذلكَ أَيْضًا: أَصْبَحْنَا وَأَصْبَحَ المُلْكُ لِلَّهِ'
    '\n\nخلاصة حكم المحدث: صحيح'
    '\nالراوي: عبدالله بن مسعود'
    '\nالمحدث: مسلم'
    '\nالمصدر: صحيح مسلم',
    'عن عبدالله بن عمر رضي الله عنه قال: لم يكنْ رسولُ اللهِ صلى الله عليه وسلم يَدَعُ هؤلاء الدعواتِ حينَ يُمسي، وحينَ يُصبِحُ :اللهم إني أسألُك العافيةَ في الدنيا والآخرةِ، اللهم إني أسألُك العفوَ والعافيةَ في ديني ودنياي وأهلي ومالي، اللهم استرْ عورتي وآمنْ روعاتي، اللهم احفظْني مِن بين يديَّ ومن خلفي وعن يميني وعن شمالي ومن فوقي، وأعوذُ بعظمتِك أن أُغتالَ مِن تحتي'
    '\n\nخلاصة حكم المحدث: صحيح'
    '\nالراوي: عبدالله بن عمر'
    '\nالمحدث: الألباني'
    '\nالمصدر: صحيح أبي داود',
    'كان النَّبيُّ صلَّى اللهُ عليه وسلَّمَ يقولُ: (اللَّهمَّ إنِّي أعوذُ بكَ مِن العَجزِ والكَسَلِ، والهَمِّ والحَزَنِ، والجُبنِ والبُخلِ، وضَلَعِ الدَّينِ وغَلَبةِ الرِّجالِ) صحيح البخاري(2893)'
    '\n\nخلاصة حكم المحدث: صحيح'
    '\nالراوي: أنس بن مالك'
    '\nالمحدث: ابن حجر العسقلاني'
    '\nالمصدر: الفتوحات الربانية',
    'عَنْ أَبِي هُرَيْرَةَ رضي الله عنه، قَالَ: قَالَ رَسُولُ اللهِ صلى الله عليه وسلم: (إذا أصبَحَ أحدُكم فليقُلْ : أصبحتُ أثنيَ عليكَ حمدًا، وأشهدُ أن لا إلَه إلَّا اللَّهُ ثلاثًا وإذا أمسى فليقُلْ مثلَ ذلِك)'
    '\n\nخلاصة حكم المحدث: حسن'
    '\nالراوي: أبو هريرة'
    '\nالمحدث: الوادعي'
    '\nالمصدر: الصحيح المسند',
    'عَنْ أَبِي هُرَيْرَةَ رضي الله عنه قَالَ:أنَّ أبا بَكرٍ الصِّدِّيقَ رَضيَ اللهُ عنه قال: يا رَسولَ اللهِ، مُرْني بكَلِماتٍ أقولُهُنَّ إذا أصبَحتُ، وإذا أمسَيتُ. قال: (قُلِ: اللَّهمَّ فاطِرَ السَّمَواتِ والأرضِ، عالِمَ الغَيبِ والشَّهادةِ، رَبَّ كُلِّ شَيءٍ ومَليكَه، أشهَدُ أنْ لا إلهَ إلَّا أنتَ، أعوذُ بِكَ مِن شَرِّ نَفْسي ومِن شَرِّ الشَّيطانِ وشِركِه. قال: قُلْها إذا أصبَحتَ وإذا أمسَيتَ وإذا أخَذتَ مَضجَعَكَ)'
    '\n\nخلاصة حكم المحدث: صحيح'
    '\nالراوي: أبو هريرة'
    '\nالمحدث: ابن دقيق'
    '\nالمصدر: الاقتراح في بيان الاصطلاح',
    'عن أنس بن مالك رضي الله عنه، أَنَّ رَسُولَ اللهٍ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، قالَ:(من قال حين يصبحُ أو يمسي: اللهمَّ إني أصبحتُ أشهدُكَ وأشهدُ حملةَ عرشِكَ، وملائكتَكَ وجميعَ خلقِك بأنَّك أنت اللهُ لا إلهَ إلا أنتَ وحدك لا شريكَ لك، وأنَّ محمَّدًا عبدُك ورسولُك أعتقَ اللهُ ربُعَه من النَّارِ، ومن قالها مرَّتين أعتقَ اللهُ نصفَه من النَّارِ، ومن قالها ثلاثًا أعتقَ اللهُ ثلاثةَ أرباعِه من النَّارِ، فإن قالها أربعًا أعتقَه اللهُ من النَّارِ)'
    '\n\nخلاصة حكم المحدث: إسناده حسن'
    '\nالراوي: أنس بن مالك'
    '\nالمحدث: ابن باز'
    '\nالمصدر: مجموع فتاوى ابن باز',
    'عن أبي الدرداءِ قال: من قال إذا أصبح وإذا أمسَى : حسبِيَ اللهُ لا إلهَ إلا هو عليه توكلتُ وهو ربُّ العرشِ العظيمِ سبعَ مراتٍ كفاه اللهُ ما أهمَّه'
    '\n\nخلاصة حكم المحدث: موقوف إسناده جيد'
    '\nالمحدث: ابن باز'
    '\nالمصدر: مجموع فتاوى ابن باز',
    'عن النبيِّ صلَّى اللهُ عليهِ وسلَّمَ أنه كان يعلِّمُ أصحابَه يقولُ إذا أصبحَ أحدُكم فليقلْ: اللهمَّ بك أصبحنا وبك أمسينا وبك نحيا وبك نموتُ وإليك النُّشورُ، وإذا أمسى فليقلِ اللهمَّ بك أمسينا وبك أصبحنا وبك نحيا وبك نموتُ وإليك المصيرُعن النبيِّ صلَّى اللهُ عليهِ وسلَّمَ أنه كان يعلِّمُ أصحابَه يقولُ إذا أصبحَ أحدُكم فليقلْ: اللهمَّ بك أصبحنا وبك أمسينا وبك نحيا وبك نموتُ وإليك النُّشورُ، وإذا أمسى فليقلِ اللهمَّ بك أمسينا وبك أصبحنا وبك نحيا وبك نموتُ وإليك المصيرُ'
    '\n\nخلاصة حكم المحدث: إسناده صحيح'
    '\nالراوي: أبو هريرة'
    '\nالمحدث: ابن باز'
    '\nالمصدر: فتاوى ابن باز',
    'عن جويرية بنت الحارث رضي الله عنها قالت: قال لي رسول الله صلى الله عليه وسلم: لقَدْ قُلتُ بَعْدَكِ أَرْبَعَ كَلِمَاتٍ ثَلَاثَ مَرَّاتٍ، لو وُزِنَتْ بما قُلْتِ مُنْذُ اليَومِ لَوَزَنَتْهُنَّ: سُبْحَانَ اللهِ وَبِحَمْدِهِ، عَدَدَ خَلْقِهِ، وَرِضَا نَفْسِهِ، وَزِنَةَ عَرْشِهِ، وَمِدَادَ كَلِمَاتِهِ'
    '\n\nخلاصة حكم المحدث: صحيح'
    '\nالراوي: جويرية بنت الحارث أم المؤمنين'
    '\nالمحدث: مسلم'
    '\nالمصدر: صحيح مسلم',
    'كان رسولُ اللهِ صلَّى اللهُ عليه وسلَّمَ إذا أَصبَحَ يقولُ: أَصبَحْنا على فِطرةِ الإسلامِ، وكَلِمةِ الإخلاصِ، ودِينِ نَبيِّنا محمَّدٍ صلَّى اللهُ عليه وسلَّمَ، وعلى مِلَّةِ أبِينا إبراهيمَ، حَنيفًا مُسلِمًا، وما كان مِنَ المُشرِكينَ'
    '\n\nخلاصة حكم المحدث: صحيح'
    '\nالراوي: عبدالرحمن بن أبزى'
    '\nالمحدث: شعيب الأرناؤوط'
    '\nالمصدر: تخريج المسند لشعيب',
    'عن أنس بن مالك رضي الله عنه قال: قال النبي صلى الله عليه وسلم لفاطمة: (ما يَمنعُكِ أنْ تسمَعِي ما أُوصِيكِ بهِ ؟ أنْ تقولِي إذا أصبحتِ وإذا أمسيْتِ : يا حيُّ يا قيُّومُ برحمتِكَ أستغيثُ، أصلِحْ لِي شأنِي كلَّهُ، ولا تكِلْنِي إلى نفسِي طرْفةَ عيْنٍ)'
    '\n\nخلاصة حكم المحدث: حسن'
    '\nالراوي: أنس بن مالك'
    '\nالمحدث: الألباني '
    '\nالمصدر: صحيح الجامع',
    'عن عبدِ الرَّحمنِ بنِ أبي بَكْرةَ أنَّه قال لأبيه: يا أبتِ إنِّي أسمعُك تدعوه كُلَّ غداةٍ: اللَّهُمَّ عافِني في بَدَني، اللَّهُمَّ عافِني في سمعي، اللَّهُمَّ عافِني في بَصَري، اللَّهُمَّ إنِّي أعوذُ بك من الكُفرِ والفَقرِ، اللَّهُمَّ إنِّي أعوذُ بك من عذابِ القبرِ، لا إلهَ إلَّا أنت، تُعيدُها حين تُصبِحُ ثلاثًا، وثلاثًا حين تُمسي، فقال: إنِّي سمعتُ رَسولَ اللهِ صلَّى اللهُ عليه وسلَّم يدعو بهنَّ؛ فأنا أحِبُّ أن أستَنَّ بسُنَّتِه'
    '\n\nخلاصة حكم المحدث: حسن'
    '\nالراوي: أبو بكرة نفيع بن الحارث'
    '\nالمحدث: ابن حجر العسقلاني '
    '\nالمصدر: الفتوحات الربانية',
    'عَنْ عَمْرِو بْنِ شَعَيْبِ، عَنْ أَبِيهِ، عَنْ جَدِّهِ، قَالَ: قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: من قال : ( سبحان اللهِ ) مئةَ مرةٍ قبل طلوعِ الشمسِ وقبل غروبِها؛ كان أفضلَ من مئةِ بدنةٍ، ومن قال : ( الحمدُ لله ) مئةَ مرةٍ قبلَ طلوعِ الشمسِ وقبلَ غروبِها؛ كان أفضلَ من مئةِ فرسٍ يُحمَلُ عليها في سبيلِ اللهِ، ومن قال : ( اللهُ أكبرُ ) مئةَ مرةٍ، قبلَ طلوعِ الشمسِ وقبلَ غروبِها، كان أفضلَ من عتقِ مئةِ رقبةٍ، ومن قال : ( لا إله إلا اللهُ وحده لا شريك له، له الملكُ، وله الحمدُ، وهو على كلِّ شيءٍ قديرٌ ) مئةَ مرةٍ قبلَ طلوعِ الشمسِ وقبلَ غروبها، لم يَجيءْ يومَ القيامةِ أَحَدٌ بعملٍ أفضلَ من عملِه، إلا من قال مثلَ قوْلِه، أو زاد عليه'
    '\n\nخلاصة حكم المحدث: حسن'
    '\nالراوي: [جد عمرو بن شعيب]'
    '\nالمحدث: الألباني '
    '\nالمصدر: صحيح الترغيب',
    'راجع دليل سبحان الله',
    'راجع دليل سبحان الله',
    'عَنْ أَبِي هُرَيْرَةَ رضي الله عنه، قَالَ: قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: (مَنْ قال حِينَ يُصبِحُ و حِينَ يُمسِي : سُبحانَ اللهِ العظيمِ و بِحمدِهِ ، مِائةَ مَرَّةٍ ، لمْ يأتِ أحدٌ يومَ القِيامةِ بأفْضلَ مِمَّا جاء به ، إلَّا أحَدٌ قال مِثلَ ذلِكَ ، و زادَ عليْهِ) صحيح مسلم(2692)'
    '\n\nخلاصة حكم المحدث: صحيح'
    '\nالراوي: أبو هريرة'
    '\nالمحدث: الألباني'
    '\nالمصدر: صحيح الجامع'
    '\n\n'
    'وعَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ: أَنَّ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: (من قال : سبحان اللهِ وبحمدِه مائةَ مرةٍ غُفرَتْ له ذنوبُه وإنْ كانتْ مثلَ زبَدِ البحرِ) صحيح البخاري(6405)'
    '\n\nخلاصة حكم المحدث: صحيح'
    '\nالراوي: أبو هريرة'
    '\nالمحدث: الألباني'
    '\nالمصدر: صحيح الترمذي',
    'عَنْ أَبِي مُوسَى رَضِيَ اللهُ عَنْهُ قَالَ: قَالَ رسول الله صلى الله عليه وسلم: (ما أصبحْتُ غداةً قطُّ إلَّا استغفرتُ اللهَ تعالى فيها مائةَ مرةٍ)'
    '\n\nخلاصة حكم المحدث: صحيح'
    '\nالراوي: أبو موسى الأشعري'
    '\nالمحدث: الألباني'
    '\nالمصدر: صحيح الجامع\n\n'
    'وعَنْ أَبِي هُرَيْرَةَ رضي الله عنه قَالَ: قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: (إنِّي لأستغفرُ اللهَ وأتوبُ إليهِ في اليومِ مائةَ مرةٍ)'
    '\n\nخلاصة حكم المحدث: حسن صحيح'
    '\nالراوي: أبو هريرة'
    '\nالمحدث: الألباني'
    '\nالمصدر: صحيح ابن ماجه',
  ];

  List<int> alsabahCounter = [
    1,3,3,3,3,3,3,1,1,1,1,3,1,4,7,1,3,1,1,3,100,100,100,100,100
  ];
//-----------------------------------------------------------------------------------------------------
  List<String> alsalah = [
    'أستغفرُ الله',
    'اللهمَّ أنتَ السَّلامُ، ومنك السَّلامُ، تبارَكْتَ يا ذا الجلالِ والإكرامِ',
    'لا إلهَ إلَّا اللهُ وحدَه لا شريكَ له، له المُلكُ وله الحمدُ، وهو على كلِّ شيءٍ قديرٌ، لا حولَ ولا قوَّةَ إلَّا باللهِ، لا إلهَ إلَّا اللهُ، ولا نعبُدُ إلَّا إيَّاهُ، له النِّعمةُ وله الفضلُ، وله الثَّناءُ الحَسَنُ، لا إلهَ إلَّا اللهُ مُخلِصينَ له الدِّينَ ولو كرِهَ الكافرونَ',
    'اللهمَّ لا مانعَ لِما أعطَيْتَ، ولا مُعطِيَ لِما منَعْتَ، ولا ينفَعُ ذا الجَدِّ منك الجَدُّ',
    'سُبحانَ الله',
    'الحمدُ لله',
    'اللهُ أكبَر',
    'لا إلهَ إلَّا اللهُ وحدَه لا شريكَ له، له المُلكُ وله الحمدُ، وهو على كلِّ شيءٍ قدير',
    'أَعُوذُ بِاللهِ مِنْ الشَّيْطَانِ الرَّجِيمِ\n'
    '﴿اللَّهُ لا إِلهَ إِلّا هُوَ الحَيُّ القَيّومُ لا تَأخُذُهُ سِنَةٌ وَلا نَومٌ لَهُ ما فِي السَّماواتِ وَما فِي الأَرضِ مَن ذَا الَّذي يَشفَعُ عِندَهُ إِلّا بِإِذنِهِ يَعلَمُ ما بَينَ أَيديهِم وَما خَلفَهُم وَلا يُحيطونَ بِشَيءٍ مِن عِلمِهِ إِلّا بِما شاءَ وَسِعَ كُرسِيُّهُ السَّماواتِ وَالأَرضَ وَلا يَئودُهُ حِفظُهُما وَهُوَ العَلِيُّ العَظيمُ﴾'
    ' [البقرة:255]',
    '{بِسْمِ اللهِ الرَّحْمنِ الرَّحِيم}\n'
    '﴿قُل هُوَ اللَّهُ أَحَدٌ۝اللَّهُ الصَّمَدُ۝لَم يَلِد وَلَم يولَد۝وَلَم يَكُن لَهُ كُفُوًا أَحَدٌ﴾'
    ' [الإخلاص: 1-4]',
    '{بِسْمِ اللهِ الرَّحْمنِ الرَّحِيم}\n'
    '﴿قُل أَعوذُ بِرَبِّ الفَلَقِ۝مِن شَرِّ ما خَلَقَ۝وَمِن شَرِّ غاسِقٍ إِذا وَقَبَ۝وَمِن شَرِّ النَّفّاثاتِ فِي العُقَدِ۝وَمِن شَرِّ حاسِدٍ إِذا حَسَدَ﴾'
    ' [الفلق: 1-5]',
    '{بِسْمِ اللهِ الرَّحْمنِ الرَّحِيم}\n'
    '﴿قُل أَعوذُ بِرَبِّ النّاسِ۝مَلِكِ النّاسِ۝إِلهِ النّاسِ۝مِن شَرِّ الوَسواسِ الخَنّاسِ۝الَّذي يُوَسوِسُ في صُدورِ النّاسِ۝مِنَ الجِنَّةِ وَالنّاسِ﴾'
    ' [الناس: 1-6]',
    'رَبِّ قِنِي عَذَابَكَ يَومَ تَبْعَثُ -أَوْ تَجْمَعُ- عِبَادَكَ',
    'اللهمَّ اغفِرْ لي ما قدَّمْتُ وما أخَّرْتُ، وما أسرَرْتُ وما أعلَنْتُ، وما أسرَفْتُ وما أنت أعلَمُ به منِّي، أنتَ المُقدِّمُ وأنتَ المُؤخِّرُ، لا إلهَ إلَّا أنت',
    'لا إلهَ إلَّا اللهُ، وَحْدَه لا شَريكَ له، له المُلكُ وله الحَمدُ، وهو على كُلِّ شَيءٍ قَدير'
    '\n(عشر مرات بعد صلاة الفجر والمغرب)',
    'اللّهُـمَّ إِنِّـي أَسْأَلُـكَ عِلْمـاً نافِعـاً وَرِزْقـاً طَيِّـباً ، وَعَمَـلاً مُتَقَـبَّلاً'
    '\n(مرة واحدة بعد صلاة الفجر)',
  ];

  List<String> fadhelAlsalahShort = [
    '',
    '',
    '',
    '',
    '[من قال سُبحانَ اللهِ ثلاثًا وثلاثينَ، والحمدُ للهِ ثلاثًا وثلاثينَ، واللهُ أكبَرُ ثلاثًا وثلاثينَ، ولا إلهَ إلَّا اللهُ وحدَه لا شريكَ له، له المُلكُ وله الحمدُ، وهو على كلِّ شيءٍ قديرٌ، مرَّةً تمامَ المائةِ، غُفِرَت خطاياه وإن كانت مِثلَ زَبَدِ البَحرِ]',
    '[من قال سُبحانَ اللهِ ثلاثًا وثلاثينَ، والحمدُ للهِ ثلاثًا وثلاثينَ، واللهُ أكبَرُ ثلاثًا وثلاثينَ، ولا إلهَ إلَّا اللهُ وحدَه لا شريكَ له، له المُلكُ وله الحمدُ، وهو على كلِّ شيءٍ قديرٌ، مرَّةً تمامَ المائةِ، غُفِرَت خطاياه وإن كانت مِثلَ زَبَدِ البَحرِ]',
    '[من قال سُبحانَ اللهِ ثلاثًا وثلاثينَ، والحمدُ للهِ ثلاثًا وثلاثينَ، واللهُ أكبَرُ ثلاثًا وثلاثينَ، ولا إلهَ إلَّا اللهُ وحدَه لا شريكَ له، له المُلكُ وله الحمدُ، وهو على كلِّ شيءٍ قديرٌ، مرَّةً تمامَ المائةِ، غُفِرَت خطاياه وإن كانت مِثلَ زَبَدِ البَحرِ]',
    '[من قال سُبحانَ اللهِ ثلاثًا وثلاثينَ، والحمدُ للهِ ثلاثًا وثلاثينَ، واللهُ أكبَرُ ثلاثًا وثلاثينَ، ولا إلهَ إلَّا اللهُ وحدَه لا شريكَ له، له المُلكُ وله الحمدُ، وهو على كلِّ شيءٍ قديرٌ، مرَّةً تمامَ المائةِ، غُفِرَت خطاياه وإن كانت مِثلَ زَبَدِ البَحرِ]',
    '[مَن قرأَ آيةَ الكُرسيِّ دُبُرَ كلِّ صلاةٍ مكتوبةٍ، لم يمنَعْه مِن دخولِ الجنَّةِ إلَّا الموتُ]',
    '',
    '',
    '',
    '',//
    '',
    '[من قالها بعد الفجر والمغرب عشر مرات كُنَّ كعَدْلِ أربَعِ رِقابٍ، وكُتِبَ له بهِنَّ عَشْرُ حَسَناتٍ، ومُحِيَ عنه بهِنَّ عَشْرُ سيِّئاتٍ، ورُفِعَ له بهِنَّ عَشْرُ دَرَجاتٍ، وكُنْ له حَرَسًا مِن الشَّيْطان]',
    '',
  ];

  List<String> fadheAlsalah = [
    'عن ثَوبانَ رضيَ اللهُ عنه مولَى رسولِ اللهِ صلَّى اللهُ عليه وسلَّم قال: ((كان رسولُ اللهِ صلَّى اللهُ عليه وسلَّم، إذا انصرَفَ مِن صلاتِه، استغفَرَ ثلاثًا...))'
    '\n\nخلاصة حكم المحدث: صحيح'
    '\nالراوي: ثوبان مولى رسول الله صلى الله عليه وسلم'
    '\nالمحدث: مسلم'
    '\nالمصدر: صحيح مسلم',
    'عن ثوبانَ رضيَ اللهُ عنه مولَى رسولِ اللهِ صلَّى اللهُ عليه وسلَّم قال: ((كان رسولُ اللهِ صلَّى اللهُ عليه وسلَّم إذا انصرَفَ مِن صلاتِه، استغفَرَ ثلاثًا، وقال: اللهمَّ أنتَ السَّلامُ، ومنك السَّلامُ، تبارَكْتَ يا ذا الجلالِ والإكرامِ))'
    '\n\nخلاصة حكم المحدث: صحيح'
    '\nالراوي: ثوبان مولى رسول الله صلى الله عليه وسلم'
    '\nالمحدث: مسلم'
    '\nالمصدر: صحيح مسلم',
    'عن عبدِ اللهِ بنِ الزُّبَيرِ رضيَ اللهُ عنه: ((أنَّه كان يقولُ في دُبُرِ كلِّ صلاةٍ حين يُسلِّمُ: لا إلهَ إلَّا اللهُ وحدَه لا شريكَ له، له المُلكُ وله الحمدُ وهو على كلِّ شيءٍ قديرٌ، لا حولَ ولا قوَّةَ إلَّا باللهِ، لا إلهَ إلَّا اللهُ، ولا نعبُدُ إلَّا إياهُ، له النِّعمةُ وله الفضلُ، وله الثَّناءُ الحسَنُ، لا إلهَ إلَّا اللهُ مُخلِصينَ له الدِّينَ ولو كرِهَ الكافرونَ، وقال: كان رسولُ اللهِ صلَّى اللهُ عليه وسلَّم يُهلِّلُ بهنَّ دُبُرَ كلِّ صلاةٍ))'
    '\n\nخلاصة حكم المحدث: صحيح'
    '\nالراوي: عبدالله بن الزبير'
    '\nالمحدث: مسلم'
    '\nالمصدر: صحيح مسلم',
    'عن المُغيرةِ بنِ شُعبةَ رضيَ اللهُ عنه، قال: ((إنَّ النبيَّ صلَّى اللهُ عليه وسلَّم كان يقولُ في دُبُرِ كلِّ صلاةٍ مكتوبةٍ: لا إلهَ إلَّا اللهُ وحدَه لا شريكَ له، له المُلكُ، وله الحمدُ، وهو على كلِّ شيءٍ قديرٌ، اللهمَّ لا مانعَ لِما أعطَيْتَ، ولا مُعْطيَ لِما منَعْتَ، ولا ينفَعُ ذا الجَدِّ منك الجَدُّ))'
    '\n\nخلاصة حكم المحدث: صحيح'
    '\nالراوي: المغيرة بن شعبة'
    '\nالمحدث: البخاري'
    '\nالمصدر: صحيح البخاري',
    'عن أبي هريرةَ، عن رسولِ اللهِ صلَّى اللهُ عليه وسلَّم: ((من سَبَّحَ اللهَ في دبُرِ كُلِّ صلاةٍ ثلاثًا وثلاثينَ، وحَمِدَ الله ثلاثًا وثلاثينَ، وكبَّرَ اللهَ ثلاثًا وثلاثينَ، فتلك تسِعةٌ وتسعونَ، وقال تمامَ المائةِ: لا إلهَ إلَّا الله وحدَه لا شريكَ له، له الملكُ وله الحمدُ، وهو على كلِّ شَيءٍ قَديرٌ، غُفِرَت خطاياه وإن كانت مِثلَ زَبَدِ البَحرِ))'
    '\n\nخلاصة حكم المحدث: صحيح'
    '\nالراوي: أبو هريرة'
    '\nالمحدث: مسلم'
    '\nالمصدر: صحيح مسلم',
    'عن أبي هريرةَ، عن رسولِ اللهِ صلَّى اللهُ عليه وسلَّم: ((من سَبَّحَ اللهَ في دبُرِ كُلِّ صلاةٍ ثلاثًا وثلاثينَ، وحَمِدَ الله ثلاثًا وثلاثينَ، وكبَّرَ اللهَ ثلاثًا وثلاثينَ، فتلك تسِعةٌ وتسعونَ، وقال تمامَ المائةِ: لا إلهَ إلَّا الله وحدَه لا شريكَ له، له الملكُ وله الحمدُ، وهو على كلِّ شَيءٍ قَديرٌ، غُفِرَت خطاياه وإن كانت مِثلَ زَبَدِ البَحرِ))'
    '\n\nخلاصة حكم المحدث: صحيح'
    '\nالراوي: أبو هريرة'
    '\nالمحدث: مسلم'
    '\nالمصدر: صحيح مسلم',
    'عن أبي هريرةَ، عن رسولِ اللهِ صلَّى اللهُ عليه وسلَّم: ((من سَبَّحَ اللهَ في دبُرِ كُلِّ صلاةٍ ثلاثًا وثلاثينَ، وحَمِدَ الله ثلاثًا وثلاثينَ، وكبَّرَ اللهَ ثلاثًا وثلاثينَ، فتلك تسِعةٌ وتسعونَ، وقال تمامَ المائةِ: لا إلهَ إلَّا الله وحدَه لا شريكَ له، له الملكُ وله الحمدُ، وهو على كلِّ شَيءٍ قَديرٌ، غُفِرَت خطاياه وإن كانت مِثلَ زَبَدِ البَحرِ))'
    '\n\nخلاصة حكم المحدث: صحيح'
    '\nالراوي: أبو هريرة'
    '\nالمحدث: مسلم'
    '\nالمصدر: صحيح مسلم',
    'عن أبي هريرةَ، عن رسولِ اللهِ صلَّى اللهُ عليه وسلَّم: ((من سَبَّحَ اللهَ في دبُرِ كُلِّ صلاةٍ ثلاثًا وثلاثينَ، وحَمِدَ الله ثلاثًا وثلاثينَ، وكبَّرَ اللهَ ثلاثًا وثلاثينَ، فتلك تسِعةٌ وتسعونَ، وقال تمامَ المائةِ: لا إلهَ إلَّا الله وحدَه لا شريكَ له، له الملكُ وله الحمدُ، وهو على كلِّ شَيءٍ قَديرٌ، غُفِرَت خطاياه وإن كانت مِثلَ زَبَدِ البَحرِ))'
    '\n\nخلاصة حكم المحدث: صحيح'
    '\nالراوي: أبو هريرة'
    '\nالمحدث: مسلم'
    '\nالمصدر: صحيح مسلم',
    'عن أبي أُمامةَ الباهليِّ رضيَ اللهُ عنه، قال: قال رسولُ اللهِ صلَّى اللهُ عليه وسلَّم: ((مَن قرأَ آيةَ الكُرسيِّ دُبُرَ كلِّ صلاةٍ مكتوبةٍ، لم يمنَعْه مِن دخولِ الجنَّةِ إلَّا الموتُ))'
    '\n\nخلاصة حكم المحدث: صحيح'
    '\nالراوي: أبو أمامة الباهلي'
    '\nالمحدث: ابن حبان'
    '\nالمصدر: بلوغ المرام',
    'عن عُقبةَ بنِ عامرٍ رضيَ اللهُ عنه، قال: ((أمَرني رسولُ اللهِ صلَّى اللهُ عليه وسلَّم أنْ أقرَأَ المُعوِّذاتِ دُبُرَ كلِّ صلاةٍ))'
    '\n\nخلاصة حكم المحدث: صحيح'
    '\nالراوي: عقبة بن عامر'
    '\nالمحدث: الألباني'
    '\nالمصدر: صحيح النسائي',
    'عن عُقبةَ بنِ عامرٍ رضيَ اللهُ عنه، قال: ((أمَرني رسولُ اللهِ صلَّى اللهُ عليه وسلَّم أنْ أقرَأَ المُعوِّذاتِ دُبُرَ كلِّ صلاةٍ))'
    '\n\nخلاصة حكم المحدث: صحيح'
    '\nالراوي: عقبة بن عامر'
    '\nالمحدث: الألباني'
    '\nالمصدر: صحيح النسائي',
    'عن عُقبةَ بنِ عامرٍ رضيَ اللهُ عنه، قال: ((أمَرني رسولُ اللهِ صلَّى اللهُ عليه وسلَّم أنْ أقرَأَ المُعوِّذاتِ دُبُرَ كلِّ صلاةٍ))'
    '\n\nخلاصة حكم المحدث: صحيح'
    '\nالراوي: عقبة بن عامر'
    '\nالمحدث: الألباني'
    '\nالمصدر: صحيح النسائي',
    'عن البَرَاءِ بنِ عازبٍ رضيَ اللهُ عنه، قال: ((كنَّا إذا صلَّيْنا خَلْفَ رسولِ اللهِ صلَّى اللهُ عليه وسلَّم، أحبَبْنا أنْ نكونَ عن يمينِه، يُقبِلُ علينا بوجهِه، قال: فسمِعْتُه يقولُ: ربِّ قِنِي عذاَبك يومَ تبعَثُ أو تجمَعُ عِبادَكَ))'
    '\n\nخلاصة حكم المحدث: صحيح'
    '\nالراوي: البراء بن عازب'
    '\nالمحدث: مسلم'
    '\nالمصدر: صحيح مسلم',
    'عن عليِّ بنِ أبي طالبٍ رضيَ اللهُ عنه، قال: ((كان النبيُّ صلَّى اللهُ عليه وسلَّم إذا سلَّمَ مِن الصَّلاةِ قال: اللهمَّ اغفِرْ لي ما قدَّمْتُ وما أخَّرْتُ، وما أسرَرْتُ وما أعلَنْتُ، وما أسرَفْتُ وما أنت أعلَمُ به منِّي، أنتَ المُقدِّمُ وأنتَ المُؤخِّرُ، لا إلهَ إلَّا أنتَ))'
    '\n\nخلاصة حكم المحدث: صحيح'
    '\nالراوي: علي بن أبي طالب'
    '\nالمحدث: مسلم'
    '\nالمصدر: صحيح مسلم',
    'عَنْ أَبِي أَيُّوبَ الأَنْصَارِيِّ، قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: ((مَن قال إذا صلَّى الصُّبحَ: لا إلهَ إلَّا اللهُ، وَحْدَه لا شَريكَ له، له المُلكُ وله الحَمدُ، وهو على كُلِّ شَيءٍ قَديرٌ، عَشْرَ مرَّاتٍ؛ كُنَّ كعَدْلِ أربَعِ رِقابٍ، وكُتِبَ له بهِنَّ عَشْرُ حَسَناتٍ، ومُحِيَ عنه بهِنَّ عَشْرُ سيِّئاتٍ، ورُفِعَ له بهِنَّ عَشْرُ دَرَجاتٍ، وكُنْ له حَرَسًا مِن الشَّيْطانِ حتى يُمسِيَ، وإذا قالَها بعدَ المَغرِبِ فمِثلُ ذلك))'
    '\n\nخلاصة حكم المحدث: صحيح'
    '\nالراوي: أبو أيوب الأنصاري'
    '\nالمحدث: شعيب الأرناؤوط'
    '\nالمصدر: تخريج المسند لشعيب',
    'عن أم سلمة رضي الله عنها أن النبي صلى الله عليه وسلم كانَ يقولُ: إذا صلَّى الصُّبحَ حينَ يُسلِّمُ: (اللَّهمَّ إنِّي أسألُكَ عِلمًا نافعًا ورزقًا طيِّبًا وعملًا متقبَّلًا)'
    '\n\nخلاصة حكم المحدث: صحيح'
    '\nالراوي: أم سلمة أم المؤمنين'
    '\nالمحدث: الألباني'
    '\nالمصدر: صحيح ابن ماجه',
  ];
//
  List<int> alsalahCounter = [
    3,1,1,1,33,33,33,1,1,1,1,1,1,1,10,1
  ];
//-----------------------------------------------------------------------------------------------------
  List<String> alnoum = [
    'First Page Content',
    'Second Page Content',
    'Third Page Content',
  ];

  List<String> fadhelAlnoumShort = [
    'First Page Content',
    'Second Page Content',
    'Third Page Content',
  ];

  List<String> fadhelalnoum = [
    'First Page Content',
    'Second Page Content',
    'Third Page Content',
  ];

  List<int> alnoumCounter = [
    1,2,3
  ];